Revit 2024 API
ServerInternalException Class
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class ServerInternalException : ApplicationException
Visual Basic
<SerializableAttribute> _
Public Class ServerInternalException _
	Inherits ApplicationException
Visual C++
[SerializableAttribute]
public ref class ServerInternalException : public ApplicationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.ServerInternalException
See Also
ServerInternalException Members
Autodesk.Revit.Exceptions Namespace